In [38]:
import pandas as pd

def count_unique_subjects(teacher: pd.DataFrame) -> pd.DataFrame:
    teacher.drop_duplicates(['teacher_id','subject_id'],inplace=True)
    grouped_teacher = teacher.groupby(['teacher_id']).count().reset_index()
    unique = pd.DataFrame({
        'teacher_id':grouped_teacher['teacher_id'],
        'cnt':grouped_teacher['dept_id']
    })
    return unique

In [39]:
teacher = pd.DataFrame({ 'teacher_id':[1,1,1,2,2,2,2],
                        'subject_id':[2,2,3,1,2,3,4],
                        'dept_id':[3,4,3,1,1,1,1]})
teacher

   teacher_id  subject_id  dept_id
0           1           2        3
1           1           2        4
2           1           3        3
3           2           1        1
4           2           2        1
5           2           3        1
6           2           4        1

In [40]:
count_unique_subjects(teacher)

   teacher_id  cnt
0           1    2
1           2    4